Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
tf.expand_dims_5 (TFOpLambda (None, 784, 1)            0         
_________________________________________________________________
fc_1 (Conv1D)                (None, 782, 32)           128       
_________________________________________________________________
fc_2 (Conv1D)                (None, 780, 32)           3104      
_________________________________________________________________
fc_3 (Dropout)               (None, 780, 32)           0         
_________________________________________________________________
fc_4 (MaxPooling1D)          (None, 390, 32)           0         
_________________________________________________________________
fc5 (Flatten)                (None, 12480)             0         
_________________________________________________________________
output (Dense)               (None, 10)                124810    
=================================================================
Total params: 128,042
Trainable params: 128,042
Non-trainable params: 0
_________________________________________________________________
