Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
tf.expand_dims (TFOpLambda)  (None, 784, 1)            0         
_________________________________________________________________
fc_1 (Conv1D)                (None, 782, 32)           128       
_________________________________________________________________
fc_2 (Conv1D)                (None, 780, 32)           3104      
_________________________________________________________________
fc_3 (Dropout)               (None, 780, 32)           0         
_________________________________________________________________
fc_4 (MaxPooling1D)          (None, 390, 32)           0         
_________________________________________________________________
fc_5 (Conv1D)                (None, 388, 16)           1552      
_________________________________________________________________
fc_6 (Conv1D)                (None, 386, 16)           784       
_________________________________________________________________
fc_7 (Dropout)               (None, 386, 16)           0         
_________________________________________________________________
fc_8 (MaxPooling1D)          (None, 193, 16)           0         
_________________________________________________________________
fc9 (Flatten)                (None, 3088)              0         
_________________________________________________________________
output (Dense)               (None, 10)                30890     
=================================================================
Total params: 36,458
Trainable params: 36,458
Non-trainable params: 0
_________________________________________________________________
