Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
tf.expand_dims_4 (TFOpLambda (None, 784, 1)            0         
_________________________________________________________________
fc_1 (Conv1D)                (None, 782, 64)           256       
_________________________________________________________________
fc_2 (Conv1D)                (None, 780, 64)           12352     
_________________________________________________________________
fc_3 (Dropout)               (None, 780, 64)           0         
_________________________________________________________________
fc_4 (MaxPooling1D)          (None, 390, 64)           0         
_________________________________________________________________
fc_5 (Conv1D)                (None, 388, 64)           12352     
_________________________________________________________________
fc_6 (Conv1D)                (None, 386, 64)           12352     
_________________________________________________________________
fc_7 (Dropout)               (None, 386, 64)           0         
_________________________________________________________________
fc_8 (MaxPooling1D)          (None, 193, 64)           0         
_________________________________________________________________
fc_9 (Conv1D)                (None, 191, 32)           6176      
_________________________________________________________________
fc_10 (Conv1D)               (None, 189, 32)           3104      
_________________________________________________________________
fc_11 (Dropout)              (None, 189, 32)           0         
_________________________________________________________________
fc_12 (MaxPooling1D)         (None, 94, 32)            0         
_________________________________________________________________
fc13 (Flatten)               (None, 3008)              0         
_________________________________________________________________
output (Dense)               (None, 10)                30090     
=================================================================
Total params: 76,682
Trainable params: 76,682
Non-trainable params: 0
_________________________________________________________________
