Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
tf.expand_dims_1 (TFOpLambda (None, 784, 1)            0         
_________________________________________________________________
fc_1 (Conv1D)                (None, 782, 64)           256       
_________________________________________________________________
fc_2 (Conv1D)                (None, 780, 64)           12352     
_________________________________________________________________
fc_3 (Dropout)               (None, 780, 64)           0         
_________________________________________________________________
fc_4 (MaxPooling1D)          (None, 390, 64)           0         
_________________________________________________________________
fc5 (Flatten)                (None, 24960)             0         
_________________________________________________________________
output (Dense)               (None, 10)                249610    
=================================================================
Total params: 262,218
Trainable params: 262,218
Non-trainable params: 0
_________________________________________________________________
