Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 1024)              803840    
_________________________________________________________________
fc_2 (Dense)                 (None, 1024)              1049600   
_________________________________________________________________
fc_3 (Dense)                 (None, 512)               524800    
_________________________________________________________________
fc_4 (Dense)                 (None, 512)               262656    
_________________________________________________________________
fc_5 (Dense)                 (None, 256)               131328    
_________________________________________________________________
fc_6 (Dense)                 (None, 256)               65792     
_________________________________________________________________
fc_7 (Dense)                 (None, 128)               32896     
_________________________________________________________________
fc_8 (Dense)                 (None, 128)               16512     
_________________________________________________________________
fc_9 (Dense)                 (None, 64)                8256      
_________________________________________________________________
fc_10 (Dense)                (None, 32)                2080      
_________________________________________________________________
fc_11 (Dense)                (None, 16)                528       
_________________________________________________________________
output (Dense)               (None, 10)                170       
=================================================================
Total params: 2,898,458
Trainable params: 2,898,458
Non-trainable params: 0
_________________________________________________________________
