Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 128)               100480    
_________________________________________________________________
fc_2 (Dense)                 (None, 96)                12384     
_________________________________________________________________
fc_3 (Dense)                 (None, 64)                6208      
_________________________________________________________________
fc_4 (Dense)                 (None, 32)                2080      
_________________________________________________________________
fc_5 (Dense)                 (None, 16)                528       
_________________________________________________________________
output (Dense)               (None, 10)                170       
=================================================================
Total params: 121,850
Trainable params: 121,850
Non-trainable params: 0
_________________________________________________________________
