Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 512)               401920    
_________________________________________________________________
fc_2 (Dense)                 (None, 256)               131328    
_________________________________________________________________
fc_3 (Dense)                 (None, 128)               32896     
_________________________________________________________________
fc_4 (Dense)                 (None, 64)                8256      
_________________________________________________________________
fc_5 (Dense)                 (None, 32)                2080      
_________________________________________________________________
output (Dense)               (None, 10)                330       
=================================================================
Total params: 576,810
Trainable params: 576,810
Non-trainable params: 0
_________________________________________________________________
