Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 1024)              803840    
_________________________________________________________________
fc_2 (Dense)                 (None, 512)               524800    
_________________________________________________________________
fc_3 (Dense)                 (None, 128)               65664     
_________________________________________________________________
fc_4 (Dense)                 (None, 64)                8256      
_________________________________________________________________
fc_5 (Dense)                 (None, 32)                2080      
_________________________________________________________________
output (Dense)               (None, 10)                330       
=================================================================
Total params: 1,404,970
Trainable params: 1,404,970
Non-trainable params: 0
_________________________________________________________________
