Model: "mnist"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 128)               100480    
_________________________________________________________________
fc_2 (Dense)                 (None, 128)               16512     
_________________________________________________________________
fc_3 (Dense)                 (None, 96)                12384     
_________________________________________________________________
fc_4 (Dense)                 (None, 96)                9312      
_________________________________________________________________
fc_5 (Dense)                 (None, 64)                6208      
_________________________________________________________________
fc_6 (Dense)                 (None, 64)                4160      
_________________________________________________________________
fc_7 (Dense)                 (None, 48)                3120      
_________________________________________________________________
fc_8 (Dense)                 (None, 48)                2352      
_________________________________________________________________
fc_9 (Dense)                 (None, 32)                1568      
_________________________________________________________________
fc_10 (Dense)                (None, 32)                1056      
_________________________________________________________________
fc_11 (Dense)                (None, 16)                528       
_________________________________________________________________
output (Dense)               (None, 10)                170       
=================================================================
Total params: 157,850
Trainable params: 157,850
Non-trainable params: 0
_________________________________________________________________
